const db = {
    "paintings": [
        {
            "id": 1,
            "title": "Марокканец, седлающий коня",
            "short_description": "Эжен Делакруа относится к течению французских романтиков. Приверженность этому направлению нашла отражение в картине \"Марокканец, седлающий коня\". Художник с потрясающей точностью передает мельчайшие...",
            "full_description": ['Эжен Делакруа относится к течению французских романтиков. Приверженность этому направлению нашла отражение в картине "Марокканец, седлающий коня". Художник с потрясающей точностью передает мельчайшие подробности сцены. Мы видим складки на одежде марокканца, каждую морщинку на его лице.', 'Сюжет полотна Эжен Делакруа почерпнул из своей поездки по Марокко. Тогда его впечатлили строгая красота марокканской природы и мужество и свободолюбие этого восточного народа, что художник и пытался выразить в своем творчестве. Но данная работа не превратилась в сухое воспроизведение этнических особенностей посещенного государства.', 'Эжен Делакруа остается верен себе и изображает марокканца сквозь призму романтизма. Простой по своей сути сюжет имеет глубинную динамику благодаря особой технике письма. Причудливое сочетание контрастных оттенков, текучесть и переливчатость цветов, строгость форм и контуров придает работе особый романтический пафос и позволяет передать сочетание внутреннее беспокойство главного героя картины за внешней показной отрешенностью.', 'nКартина написана "тяжелой кистью". Густые мазки усиливают гнетущее беспокойство главного героя. Грозовые тучи, волнующееся море, контрастность цветов фона и грустная фигура всадника, удаляющегося на втором плане, придают картине настроение тревожного ожидания. Кинжал на поясе марокканца, красная ткань, словно обжигающая ему руки и встревоженная поза коня, подсказывают, что героя ожидает в поездке определенное событие. И нет никакой уверенности, что его исход будет благоприятным для героя. Но что должно произойти с марокканцем в путешествии, художник умалчивает, позволяя зрителю додумать финал истории самостоятельно.'],
            "filename": "marrocanec.jpg",
            "slug": "marrocanec",
        },
        {
            "id": 2,
            "title": "Свобода, ведущая народ (Свобода на баррикадах)",
            "short_description": 'Уже впоследствии картина Эжена Делакруа, написанная им в 1830 году, стала именоваться “Свобода на баррикадах”, но первоначально она носила название “Свобода, ведущая народ”. Иногда бытовало ошибочное мнение, что полотно создано под влиянием...',
            "full_description": ['Уже впоследствии картина Эжена Делакруа, написанная им в 1830 году, стала именоваться “Свобода на баррикадах”, но первоначально она носила название “Свобода, ведущая народ”.', 'Иногда бытовало ошибочное мнение, что полотно создано под влиянием Великой французской революции, однако, на самом деле, Делакруа посвятил сюжет картины событиям июля 1830 года, когда в Париже шли ожесточенные уличные бои, приведшие к свержению Карла X, последнего из рода Бурбонов, коих так люто ненавидело население Франции.', 'Молодой Эжен Делакруа, позиционировавший себя не как революционера, но как мятежника, окрыленный и опьяненный свежим воздухом свободы и свершившихся побед, загорелся идеей написать картину о тех кровопролитных днях и подвиге своего народа. На осуществление поставленной перед самим собой задачи художнику понадобилось три месяца, по прошествии которых взорам восхищенной публики предстала “Свобода, ведущая народ”.', 'Сюжет полотна рассказывает о фрагменте жаркого сражения, где отряд вооруженных повстанцев через тела своих погибших товарищей и сквозь свист пуль пробивается к намеченной цели.', 'Впереди всех, с поднятым в одной руке трехцветным флагом французской Республики и с ружьем в другой, находится женщина. Это Свобода, увлекающая людей в атаку. На ней фригийский колпак, характерный для якобинцев и обнаженная грудь, что символизирует неистовое желание революционеров идти голой грудью на королевские штыки.', 'Кисть живописца безупречно подчеркнула разнообразные наряды восставших, указывая на то, что на уличных баррикадах плечом к плечу воевали представители самых разных слоев общества. Делакруа также присутствует на картине в образе мужчины в цилиндре слева от Свободы, несмотря на то, что участия в уличных боях он не принимал.'],
            "filename": "freedom.jpg",
            "slug": "freedom",
        },
        {
            "id": 3,
            "title": "Резня на Хиосе",
            "short_description": 'На картине Делакруа отражен один из трагических эпизодов в истории Греции. В один из дней сентября 1821 г., турецкие войска вторглись на остров Хиос, что в Эгейском море. В отместку за то, что...',
            "full_description": ['На картине Делакруа отражен один из трагических эпизодов в истории Греции. В один из дней сентября 1821 г., турецкие войска вторглись на остров Хиос, что в Эгейском море. В отместку за то, что местное население с сочувствием отнеслось к событиям народно-освободительной борьбы греческого народа против турецкого ига, турки вырезали десятки тысяч жителей и тысячи угнали в рабство.', 'Картина "Резня на Хиосе", стала своеобразным ответом на бесчеловечность этой акции. На фоне вооруженных всадников, перед зрителем предстают обреченные на смерть жители острова. Они смирились с предстоящей гибелью, их взгляды отрешены. Хиосцы осознают неизбежность и лишь крепче прижимают к себе плачущих детей. А на втором плане – аккуратные здания расположились в долине, освещаемой благодатным солнцем Средиземноморья. Там тоже поселилась смерть, турецкие войска убивают всех подряд.', 'Взгляд зрителя скользит дальше и долина сменяется пасмурными водами Эгейского моря, впитавшими в себя всю боль и жестокость разыгравшейся драмы. Светлая полоса неба над темной гладью моря, равнодушно взирает на всех участников', 'Делакруа возвращается к образному языку и символизму древнегреческой трагедии. Турецкий кавалерист, который волочит за собой обнаженную гречанку, остается непоколебим и холоден к страданиям несчастных. Он – знак грядущей неволи и оков. Символичен и маленький ребенок, тщетно пытающийся прильнуть к груди убитой матери. Кровь, красным ручьем вытекает из тела смертельно раненного мужчины и щедро окропляет высохшую почву.', 'Обломок кинжала рядом, показывает, что силы сопротивления истощены и сломлены. Пустая торба недалеко от кинжала, символизирует о моральной и материальной опустошенности этой опаленной и политой страданиями земли.'],
            "filename": "massacres.jpg",
            "slug": "massacres",
        },
        {
            "id": 4,
            "title": "Ладья Данте",
            "short_description": 'Делакруа позаимствовал сюжет для своей знаменитой «Ладьи» из легендарной «Божественной комедии». Именно, благодаря этой работе, художник был отмечен первым большим достижением в свои 24 года. В самом названии полотна уже содержится ссылка на...',
            "full_description": ['Делакруа позаимствовал сюжет для своей знаменитой «Ладьи» из легендарной «Божественной комедии». Именно, благодаря этой работе, художник был отмечен первым большим достижением в свои 24 года. В самом названии полотна уже содержится ссылка на символичность написанного образа. Ведь еще у древних предков ладью, как правило, ассоциировали с жизненным началом. К тому же на ладье совершали перемещения в мир иной и т. п.', 'Образ лодки много веков считавшийся символическим образом Христианства и в частности церкви, в живописном исполнении французских художников-романтиков приобретает обновленное символичное значение.', 'На этом холсте четко прослеживается давно определенное Делакруа творческое кредо. Суть которого заключалась в поклонении легендарным мастерам слова Данте и Вергилию. Они в то время считались символами культурного наследия не только своих эпох.', 'Образы грешников, которые так усердно цепляются за борт лодки в надежды на спасение, написаны на основе впечатлений от скульптуры Микеланджело «Ночь». А из традиционно барочного влияния в картине четко прослеживается трагичное звучание «Плота Медузы».', 'Среди приговоренных грешников, которые пытаются попасть в лодку, у одних проявляется максимальная ожесточенность, неимоверная злоба, у других, ослабленных тяжелой борьбой за возможность попасть в лодку, иссякли все силы и они отдались силе волн. По мнению самого художника, лучше всего ему удалось написать образ грешника, почти попавшего в ладью, что на втором плане. А писалась она, как видно из д записи в дневнике, неимоверно быстро и большим вдохновением, при чтении поэзии Данте. Живописный гений Делакруа вдохнул новую жизненную силу в классический литературный сюжет. Окончательно не избавившись от классического идеала, автор пишет по-настоящему романтическое полотно, воплотившее рожденный в его воображении жестокий мир необузданной силы.'],
            "filename": "rook.jpg",
            "slug": "rook",
        },
        {
            "id": 5,
            "title": "Смерть Сарданапала",
            "short_description": 'Поэма, написанная в 1821 г. Байроном по мотивам легенд о царе Сарданапале, через 6 лет сподвигла легендарного творца масштабных полотен на создание великой композиции драматического характера. На картине мы видим, как...',
            "full_description": ['Поэма, написанная в 1821 г. Байроном по мотивам легенд о царе Сарданапале, через 6 лет сподвигла легендарного творца масштабных полотен на создание великой композиции драматического характера.', 'На картине мы видим, как великий Сарданапал возлежит, облокотившись, на собственном ложе в то время, когда враги уже готовы через пробоины в стенах укрепления ворваться в осажденный город. Царь спокойно наблюдает жуткое зрелище кровавой резни и невероятной растерянности.', 'Все персонажи картины, за исключением спокойно наблюдающего за всем Сарданапала и слуги, который услужливо подает ему кубок с ядом с целью совершения самоубийства, изнемогают от адской боли, насилия и страха. Это произведение мастера Делакруа является отличительным полотном, характерным для французского романтического направления в начале XIXв.. Ощутимо присутствует в нем и могущественная энергетика, и холодный блеск золота, и роскошное сияние камней. А передает автор всю эту роскошь, используя яркие сочные краски, которые наносит большими четкими мазками.', 'По легенде, Сарданапал царствовал Ассирии (VII в. до н. э), где вел роскошный и беспутный образ жизни. А когда индоевропейское племя мидян взяло в осаду его столицу, он через два года, проведенные жителями в осажденном городе, врагам решил не сдаваться: было приказано город и все его богатства просто уничтожить. Сам же приготовился принять яд, но перед этим велел сжечь своих жен, слуг и все сокровища в большом костре вместе с ним. Не пожалел даже возлюбленную – наложницу Мирру, ей оказали особую честь смешать свой пепел с его.', 'Этот жуткий костер полыхал почти 15 дней. Зрелище не для слабонервных! Картина в прочем тоже вызывает бурю эмоций и чувств отнюдь не позитивных. Особенно поражают детали на таком масштабном холсте.'],
            "filename": "death.jpg",
            "slug": "death",
        },
        {
            "id": 6,
            "title": "Алжирские женщины",
            "short_description": 'Картина «Алжирские женщины» (часто «Алжирские женщины в своих покоях») была написана Эженом Делакруа в 1834 году и позднее послужила источником вдохновения для Пикассо, Матисса и Ренуара. Большое впечатление на художника произвел...',
            "full_description": ['Картина «Алжирские женщины» (часто «Алжирские женщины в своих покоях») была написана Эженом Делакруа в 1834 году и позднее послужила источником вдохновения для Пикассо, Матисса и Ренуара.', 'Большое впечатление на художника произвел гарем, который он увидел в Алжире во время своей поездки по Северной Африке. Находясь в гостях у одного султана, Делакруа очень посчастливилось попасть в святую святых мусульманского мирка, где ему предстали в своей красе наложницы, которые и стали героинями картины «Арабские женщины». Несмотря на то, что жизнь их не отличалась от обычной жизни, а женщины не были такими романтичными натурами, какими они предстали на полотне.', 'Четыре женщины разных рас и национальностей сидят на коврах с подушками и курят кальян. Чернокожая наложница уходит за пределы картины, что-то говоря напоследок остающимся девушкам. Лица последних наполнены покоем и женственностью, а позы расслаблены и вальяжны. Каждая из них смотрит туманным взглядом вдаль и не совсем понятно что именно он выражает: умиротворение, грусть, тоску… Или эта пелена на глазах результат подействовавшего на хрупких девушек кальяна? Одежды наложниц разнообразны, но самый элегантный наряд у лежащей слева. И хотя кольца и ожерелья ее несильно отличаются от украшений других женщин, мы можем предположить, что именно она числится любимицей у султана.', 'В этой картине художник, по мнению множества экспертов, начинает свои эксперименты с цветом и добавляет дополнительные цвета (красный, зеленый), которыми написаны контрастирующие во всей композиции детали. А в остальном – картина так же великолепно выполнена, как и другие работы мастера.', 'Проявляя интерес к различной экзотике, после возвращения из Северной Африки Делакруа создает серию картин, посвященных характеру, нравам и быту, который он отобразил еще во время поездки во многих набросках. Это произведение стало своеобразной вехой в творчестве Делакруа и в истории всего искусства.'],
            "filename": "women.jpg",
            "slug": "women",
        },
        {
            "id": 7,
            "title": "Данте и Вергилий",
            "short_description": 'Эжена Делакруа по праву считают основателем французского романтизма. Большинство его работ представляют собой напряженные эпические сюжеты, выполненные в сочных контрастных цветах, не свойственных еще господствующему во Франции в начале XIX века неоклассицизму. Ранняя смерть родителей заставляет юношу',
            "full_description": ['Эжена Делакруа по праву считают основателем французского романтизма. Большинство его работ представляют собой напряженные эпические сюжеты, выполненные в сочных контрастных цветах, не свойственных еще господствующему во Франции в начале XIX века неоклассицизму.', 'Ранняя смерть родителей заставляет юношу искать пути к образованию, и Школа изящных искусств в Париже становится для него своеобразной альма-матер. Талантливый, трудолюбивый и бесшабашный Эжен уже в юности обзаводится именитыми друзьями, среди которых были Александр Дюма и Ричард Бонигтон. Но самое сильное влияние на молодого художника оказало творчество Теодора Жерико. Нашумевшая в 1819 году его картина "Плот "Медуза", созданная под влиянием широко обсуждаемых в то время реальных трагических событий на фрегате "Медуза", для которой Эжен даже позировал, настолько впечатлила будущего мастера романтизма, что спустя три года Делакруа создает свое полотно "Данте и Вергилий", которое по мнению критиков и ценителей живописи тех лет имело явное стилистическое сходство со скандальным творением Жерико.',
                'Полотно написано на тему 8-ой песни Ада из "Божественной комедии" Данте, где поэт рассказывает свое видение о прохождении вместе с Вергилием через круги ада. На восьмом круге им пришлось переправляться через болото близ мертвого пылающего города Дит, где в грязных водах страдали истерзанные грешные души. На картине запечатлен момент, когда Данте в одном из обезумевших от мук грешников, из последних сил пытающихся забраться в ладью, узнает своего личного врага и от неожиданности и ужаса происходящего в испуге вскидывает руку, как бы стараясь от него отстраниться. Вергилий же хочет успокоить поэта и придерживает его за другую руку.', 'Весь сюжет картины исполнен динамикой и эмоциональным накалом. "Гневные", цепляющиеся за ладью, запечатлены в разных ракурсах и позах – кто-то с звериной злобой и ожесточением почти вскарабкался на борт, другие, выбившись из сил, безвольно отдались затягивающему водному потоку. Их обнаженные тела прописаны светлыми тонами на контрасте с темной водой и бортом лодки, и это усиливает необъяснимое ощущение, что они продолжат движение, стоит только отвести взгляд. Согнутая напряженная спина правящего лодкой злодея Флегия рядом с бесстрастным с Вергилием добавляет зловещности моменту.', 'Несмотря на обвинения приверженцев академического классицизма в слабой изобразительной технике и неубедительности контуров фигур, современники единодушно признали, что дебют картины состоялся.'],
            "filename": "dante_virgiliy.jpg",
            "slug": "dante_virgiliy",
        },
        {
            "id": 8,
            "title": "Охота на львов в Марокко",
            "short_description": 'Свою картину "Охота на львов в Марокко" Делакруа пишет в 1854 году по воспоминаниям двадцатилетней давности о путешествии в Восточную Африку. Стиль живописи, эмоциональная напряженность запечатленной сцены подготовки к бою со зверем двух охотников достаточно типична для Делакруа, но ярко выделялась среди приверженцев...',
            "full_description": ['Свою картину "Охота на львов в Марокко" Делакруа пишет в 1854 году по воспоминаниям двадцатилетней давности о путешествии в Восточную Африку. Стиль живописи, эмоциональная напряженность запечатленной сцены подготовки к бою со зверем двух охотников достаточно типична для Делакруа, но ярко выделялась среди приверженцев классицизма, еще господствовавшего в искусстве Франции середины XIX века.', 'Большинство работ Эжен Делакруа пишет на литературные или исторические сюжеты, особенно впечатлившие художника, выбирая момент апофеоза события или определенного предвкушения кульминации, когда все участники сцены – и природа, и люди – еще находятся в смятении перед последней минутой, но ножи уже занесены для рокового удара, ружья заряжены, приготовлены бокалы с ядом.', 'Так и охота в Марокко отразила секунду до схватки людей с разъяренным львов. Двое охотников расположились в засаде под деревом на небольшом скалистом утесе возле горной реки. Их ярко-красные и почти белоснежные одеяния резко контрастируют с тенью дерева и скал, несколько неестественные изгибы рук и стоп, обнаженный клинок на переднем плане картины – все это подчеркивает еще сдерживаемый сгусток энергии, который через мгновение перейдет в тяжелый поединок со зверем с непредсказуемым исходом. Под утесом еще двое арабов пытаются успокоить рвущуюся от страха лошадь. Слепящее голубое небо и горный поток разрезают глубокую тень дерева и скал, нарушая общий световой баланс изображения, чем усиливается динамичность сюжета на фоне умиротворяющего горного пейзажа.', 'Работая над картиной, Эжен Делакруа параллельно делает эскизы для своей большой "Охоты на львов", тему которой он снова выбирает, уже для Всемирной выставки в Париже 1855 г. Так основатели романтизма, путешествуя по экзотическим странам, привнесли новый яркий стиль и необычные сюжеты в культуру академического Старого Света.'],
            "filename": "hunting.jpg",
            "slug": "hunting",
        },
    ]
}

function get_painting_by_slug(slug) {
    return db.paintings.find(function (painting) {
        return painting.slug == slug;
    })
}

function get_posiion_by_slug(slug) {
    for (let [index, element] of db.paintings.entries()) {
        if (element.slug == slug)
            return index;
    }

    return -1;
}

function get_painting_by_pos(pos) {
    if (pos < 0 || pos > db.paintings.length) {
        return null;
    }
    else {
        return db.paintings[pos];
    }
}

function get_paintings_amount() {
    return db.paintings.length
}

